In [54]:
import pandas as pd

import numpy as np

import matplotlib as plt

In [55]:
data = pd.read_csv("train.csv")

print(data.shape)
print(data.columns, len(data.columns))
data.head()

(421570, 5)
Index(['Store', 'Dept', 'Date', 'Weekly_Sales', 'IsHoliday'], dtype='object') 5

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  2010-02-05      24924.50      False
1      1     1  2010-02-12      46039.49       True
2      1     1  2010-02-19      41595.55      False
3      1     1  2010-02-26      19403.54      False
4      1     1  2010-03-05      21827.90      False

In [56]:
store_data = pd.read_csv("stores.csv")
print(store_data.shape)
print(store_data.columns, len(store_data.columns))
store_data.head()

(45, 3)
Index(['Store', 'Type', 'Size'], dtype='object') 3

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [66]:
features_data = pd.read_csv("features.csv")
print(features_data.shape)
print(features_data.columns, len(features_data.columns))
features_data.head()

(8190, 12)
Index(['Store', 'Date', 'Temperature', 'Fuel_Price', 'MarkDown1', 'MarkDown2',
       'MarkDown3', 'MarkDown4', 'MarkDown5', 'CPI', 'Unemployment',
       'IsHoliday'],
      dtype='object') 12

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,2010-02-05,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,2010-02-12,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,2010-02-19,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,2010-02-26,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,2010-03-05,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False

In [58]:
data = pd.merge(data, store_data, on="Store" )
data.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday Type    Size
0      1     1  2010-02-05      24924.50      False    A  151315
1      1     1  2010-02-12      46039.49       True    A  151315
2      1     1  2010-02-19      41595.55      False    A  151315
3      1     1  2010-02-26      19403.54      False    A  151315
4      1     1  2010-03-05      21827.90      False    A  151315

In [74]:
data = data.merge(features_data, left_on=['Store', 'Date'] , right_on=['Store', 'Date'] , how='left')

In [76]:
data

,Store,Dept,Date,Weekly_Sales,IsHoliday,Type,Size,Temperature,Fuel_Price
0,1,1,2010-02-05,24924.50,False,A,151315,42.31,2.572
1,1,1,2010-02-12,46039.49,True,A,151315,38.51,2.548
2,1,1,2010-02-19,41595.55,False,A,151315,39.93,2.514
3,1,1,2010-02-26,19403.54,False,A,151315,46.63,2.561
4,1,1,2010-03-05,21827.90,False,A,151315,46.50,2.625
...,...,...,...,...,...,...,...,...,...
421565,45,98,2012-09-28,508.37,False,B,118221,64.88,3.997
421566,45,98,2012-10-05,628.10,False,B,118221,64.89,3.985
421567,45,98,2012-10-12,1061.02,False,B,118221,54.47,4.000
421568,45,98,2012-10-19,760.01,False,B,118221,56.47,3.969
421569,45,98,2012-10-26,1076.80,False,B,118221,58.85,3.882

In [67]:
features_data  = features_data[['Store', 'Date', 'Temperature', 'Fuel_Price']]

In [68]:
features_data

      Store        Date  Temperature  Fuel_Price
0         1  2010-02-05        42.31       2.572
1         1  2010-02-12        38.51       2.548
2         1  2010-02-19        39.93       2.514
3         1  2010-02-26        46.63       2.561
4         1  2010-03-05        46.50       2.625
...     ...         ...          ...         ...
8185     45  2013-06-28        76.05       3.639
8186     45  2013-07-05        77.50       3.614
8187     45  2013-07-12        79.37       3.614
8188     45  2013-07-19        82.84       3.737
8189     45  2013-07-26        76.06       3.804

[8190 rows x 4 columns]

In [73]:
len(features_data['Store'].unique())

45

In [ ]:
# save data for furhter use

In [77]:
data.to_csv('data.csv', sep='\t', encoding='utf-8')